GHB2/src/Catalogs/гхб_НомераТелефонов/гхб_НомераТелефонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_НомераТелефонов</name>
  <attributes>
    <name>НеИспользоватьПриРассылкеСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриОбменеСАД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойНомер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_СлужебныеЗначения/гхб_СлужебныеЗначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_СлужебныеЗначения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Администрирование</name>
      <description>Администрирование</description>
    </items>
    <items>
      <name>МобильнаяСвязь</name>
      <description>Мобильная связь</description>
    </items>
    <items>
      <name>ОбменДанными</name>
      <description>Обмен данными</description>
    </items>
    <items>
      <name>Помещения</name>
      <description>Помещения</description>
    </items>
    <items>
      <name>Пропуска</name>
      <description>Пропуска</description>
    </items>
    <items>
      <name>ПутиКФайлам</name>
      <description>Пути к файлам</description>
    </items>
    <items>
      <name>СервисДеск</name>
      <description>Сервис деск</description>
    </items>
    <items>
      <name>ЭлектроннаяПочта</name>
      <description>Электронная почта</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>7</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтрокаНеограничена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_НомераТелефонов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	ВключенаАвтоМиграция = Справочники.гхб_СлужебныеЗначения.ВключенаАвтоМиграцияВБазыРИБ.Значение;
	ОтчетыКлиентСервер.ПривестиЗначениеКТипу(ВключенаАвтоМиграция, Новый ОписаниеТипов("Булево"));
	Если НЕ ВключенаАвтоМиграция Тогда
		Возврат
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ссылка", Ссылка);
	
	СтруктураСвойствКЗаполнению = Новый Структура;
	СтруктураСвойствКЗаполнению.Вставить("НаименованиеТелефона", Наименование);
	СтруктураСвойствКЗаполнению.Вставить("НеИспользоватьПриРассылкеСМС", НеИспользоватьПриРассылкеСМС);
	СтруктураСвойствКЗаполнению.Вставить("НеИспользоватьПриОбменеСАД", НеИспользоватьПриОбменеСАД);
	СтруктураСвойствКЗаполнению.Вставить("ОсновнойНомер", ОсновнойНомер);
	
	СтруктураПараметров.Вставить("СтруктураСвойствКЗаполнению", СтруктураСвойствКЗаполнению);
	
	ОбменПрошел = гхб_МобильнаяСвязьСервер.ОтправитьСправочникВБазыРИБ("СоздатьИзменитьЭлементСправочникаДанныеТелефонов",
																		СтруктураПараметров);
	Если НЕ ОбменПрошел Тогда
		Отказ = Истина;
	КонецЕсли;																	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
